<?php

return [

    'tour' => [
        'added' => 'Тур успешно добавлен',
        'add_err' => 'Ошибка добавления тура',
        'updated' => 'Тур успешно обновлен',
        'update_err' => 'Ошибка обновления тура',
        'deleted' => 'Тур успешно удален',
        'missing' => 'Тур отсутствует'
    ],
    'review' => [
        'added' => 'Отзыв успешно добавлен',
        'add_err' => 'Ошибка добавления отзыва',
        'updated' => 'Отзыв успешно обновлен',
        'update_err' => 'Ошибка обновления отзыва',
        'deleted' => 'Отзыв успешно удален',
        'missing' => 'Отзыв отсутствует'
    ],
    'update_err' => [
        'all_fields_is_empty' => 'Ошибка обновления (все поля пусты)'
    ]

];
