<?php

return [

    'user' => [
        'added' => 'Пользователь успешно зарегистрирован',
        'add_err' => 'Ошибка регистрации пользователя',
        'logged' => 'Пользователь успешно залогинен',
        'login_err' => 'Ошибка аутентификации',
        'does_not_match' => 'Логин и пароль не совпадают',
        'logout' => 'Пользователь успешно разлогинен',
        'already_logout' => 'Пользователь не существует или уже разлогинен',
    ],
    'tourist' => [
        'added' => 'Турист успешно добавлен',
        'add_err' => 'Ошибка добавления туриста',
        'updated' => 'Турист успешно обновлен',
        'update_err' => 'Ошибка обновления туриста',
        'deleted' => 'Турист успешно удален',
        'missing' => 'Турист отсутствует'
    ],
    'trip' => [
        'added' => 'Поездка успешно добавлена',
        'add_err' => 'Ошибка добавления поездки',
        'updated' => 'Поездка успешно обновлена',
        'update_err' => 'Ошибка обновления поездки',
        'deleted' => 'Поездка успешно удалена',
        'missing' => 'Поездка отсутствует'
    ],
    'additional_service' => [
        'added' => 'Доп. услуга успешно добавлена',
        'add_err' => 'Ошибка добавления доп. услуги',
        'updated' => 'Доп. услуга успешно обновлена',
        'update_err' => 'Ошибка обновления доп. услуги',
        'deleted' => 'Доп. услуга успешно удалена',
        'missing' => 'Доп. услуга отсутствует'
    ],
    'tour' => [
        'added' => 'Тур успешно добавлен',
        'add_err' => 'Ошибка добавления тура',
        'updated' => 'Тур успешно обновлен',
        'update_err' => 'Ошибка обновления тура',
        'deleted' => 'Тур успешно удален',
        'missing' => 'Тур отсутствует'
    ],
    'order' => [
        'added' => 'Заказ успешно создан',
        'add_err' => 'Ошибка создания заказа',
        'not_seats' => 'Недостаточно свободных мест для бронирования',
        'no_tourist' => 'Передан несуществующий ID туриста',
        'no_service' => 'Передан несуществующий ID доп. услуги',
    ],
    'review' => [
        'added' => 'Отзыв успешно добавлен',
        'add_err' => 'Ошибка добавления отзыва',
        'updated' => 'Отзыв успешно обновлен',
        'update_err' => 'Ошибка обновления отзыва',
        'deleted' => 'Отзыв успешно удален',
        'missing' => 'Отзыв отсутствует'
    ],
    'update_err' => [
        'all_fields_is_empty' => 'Ошибка обновления (все поля пусты)'
    ]

];
