<?php

namespace App\Traits;

trait OldToursTrait
{
    public function getOldTours()
    {
        return [
            'success' => true,
            'data' => [
                [
                    'description' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'order' => 0,
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    'trips' => [
                        [
                            'cost' => "16000",
                            'minCost' => "1700",
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
                [
                    'description' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    'trips' => [
                        [
                            'cost' => "15000",
                            'minCost' => 1700,
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
                [
                    'description' => "",
                    'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    'trips' => [
                        [
                            'cost' => "15000",
                            'minCost' => 1700,
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
                [
                    'description' => "",
                    'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    "minCost" => 1700,
                    'trips' => [
                        [
                            'cost' => "15000",
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
                [
                    'description' => "",
                    'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    'trips' => [
                        [
                            'cost' => "15000",
                            'minCost' => 1700,
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
                [
                    'description' => "",
                    'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                    'duration' => "1 день",
                    'id' => 50,
                    'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                    'name' => 'ЦАО Евразия',
                    'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                    'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                    'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                    'season' => "winter",
                    "thumbnail" => false,
                    'trips' => [
                        [
                            'cost' => "15000",
                            'minCost' => 1700,
                            'dateEnd' => "30.09.2022",
                            'dateStart' => "26.09.2022",
                            'id' => 14,
                            'services' => [
                                [
                                    'cost' => "1000",
                                    'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                    'id' => 26,
                                    'name' => "Услуга 1",
                                    'prepayment' => "10"
                                ]
                            ],
                            'touristLimit' => "20",
                        ]
                    ],
                    'video' => false
                ],
            ],
        ];
    }
}
