<?php

namespace App\Http\Controllers;

class ApiController extends Controller
{
    public function reviews()
    {
        $photo1 = 'img/review/yr-N8SZGjko_3a2.jpg';
        $photo2 = 'img/review/yr-N8SZGjko_e21.webp';
        $photo3 = 'img/review/mBrUUARCKa8_c96.jpg';
        $photo4 = 'img/review/mBrUUARCKa8_d02.webp';
        $link = "https://vk.com/topic-112512427_34660772";

        $reviews = [
            [
                'name' => "Hamdan Ahmed-Baig",
                'text' => "You guys made me feel like it's a home and i am surrounded by big family of loving and caring people, all of you guys, you have literally made the best moment in my life forever. I would like to say special thanks to the organizer of the trip Erken who called me \"мой друг\" at first sight, I have been to many trips but never seen such a great caring person, a great organizer and a responsible man. (Вы, ребята, заставили меня почувствовать себя как дома, будто я окружен большой семьей любящих и заботливых людей, все вы, ребята, буквально сделали лучший момент в моей жизни. Я хотел бы сказать особую благодарность организатору поездки Еркену, который назвал меня \"мой друг\" с первого взгляда. Я был во многих поездках, но никогда не видел такого неравнодушного человека, великолепного Организатора с большой буквы).",
                'link' => $link,
                'img' => $photo1,
                'imgWebp' => $photo2,
            ],
            [
                'name' => "Олег Ефимов",
                'text' => 'Ребята большие молодцы. Дали крутую организацию, вкусную еду, адекватность во взаимодействиях и всепроницающую легкость. Это большая трудность - организовать времяпровождение людей так, чтобы позволить им кайфануть всем вместе. Люди разные, вайб у всех разный и нужно это услышать. "Позитив" умеет слышать. И поэтому вряд ли кто-то мог сделать этот сплав лучше, чем эти ребята!',
                'link' => $link,
                'img' => $photo3,
                'imgWebp' => $photo4,
            ]
        ];

        return response()->json($reviews);
    }

    public function tours()
    {
        $tours = [
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
            [
                'description' => "",
                'descriptionShort' => "Однодневный выезд в ЦАО ЕВРАЗИЯ  СТОИМОСТЬ поездки: 1800 руб. - большой склон 2000 руб. - программа НОВИЧОК 1200 руб. - учебный склон  В стоимость включено: - трансфер Челябинск-Евразия-Челябинск; - скипасс 5 часов; - веселая компания; - отличное настроение.  Программа НОВИЧОК. Включено: - трансфер; - скипасс 5 часов на учебный склон; - прокат снаряжения; - инструктор 2 часа.",
                'duration' => "1 день",
                'id' => 50,
                'images' => ['/wp-content/themes/pozitiv/js/images/2e411014db42fb705c8c8da9fa2ba23d.png'],
                'name' => 'ЦАО Евразия',
                'nameWP' => 'ЦАО Евразия',
                'order' => 0,
                'place' => "пример: Россия, Челябинская область, г. Куса, горнолыжный курорт Евразия",
                'plan' => "<p>ПРОГРАММА ВЫЕЗДА:</p>\n<p>06:30 &#8211; Сбор на Бр. Кашириных 75, ТЦ Лента<br />\n07:00 &#8211; Отправление из г. Челябинска<br />\n10:30 &#8211; Прибытие на ГЛЦ &#8220;Евразия&#8221;<br />\n11:00 &#8211; 16:00 &#8211; Катание<br />\n16:30 &#8211; Отправление в Челябинск<br />\n20:00 &#8211; Прибытие в г. Челябинск.</p>\n<p>*время условное</p>\n",
                'planPicture' => '/wp-content/themes/pozitiv/js/images/89d24ccfc9d23e12d68d059ff9b7dedf.png',
                'season' => "winter",
                "thumbnail" => false,
                "minCost" => 1700,
                'trips' => [
                    [
                        'cost' => "15000",
                        'dateEnd' => "30.09.2022",
                        'dateStart' => "26.09.2022",
                        'id' => 14,
                        'services' => [
                            [
                                'cost' => "1000",
                                'description' => "<!-- wp:paragraph -->\n<p>ор орпролп лр лрол</p>\n<!-- /wp:paragraph -->",
                                'id' => 26,
                                'name' => "Услуга 1",
                                'prepayment' => "10"
                            ]
                        ],
                        'touristLimit' => "20",
                    ]
                ],
                'video' => false
            ],
        ];
        return response()->json(['tours' => $tours]);
    }
}
